# Marging:
- It's based on common key(or columns), similar to SQL joins.
- It's used when we want to align data from two different datasets based on shared values.(eg: ID, Names)

# Joining:
- A special case of merging that combines DFs based on their index or key column.
- It's specially used when DFs share a common index.

# Concatenation.
-  Stacks DFs either vertically(adding rwos), or horizontally (adding columns).
- It's used when combining datasets with similar structures withour matching keys.

# Practical Approach

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
tips = sns.load_dataset('tips')
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [6]:
tips['customer_id'] = pd.Series(np.arange(1,245))
tips

     total_bill   tip     sex smoker   day    time  size  customer_id
0         16.99  1.01  Female     No   Sun  Dinner     2            1
1         10.34  1.66    Male     No   Sun  Dinner     3            2
2         21.01  3.50    Male     No   Sun  Dinner     3            3
3         23.68  3.31    Male     No   Sun  Dinner     2            4
4         24.59  3.61  Female     No   Sun  Dinner     4            5
..          ...   ...     ...    ...   ...     ...   ...          ...
239       29.03  5.92    Male     No   Sat  Dinner     3          240
240       27.18  2.00  Female    Yes   Sat  Dinner     2          241
241       22.67  2.00    Male    Yes   Sat  Dinner     2          242
242       17.82  1.75    Male     No   Sat  Dinner     2          243
243       18.78  3.00  Female     No  Thur  Dinner     2          244

[244 rows x 8 columns]

In [7]:
customer_data = pd.DataFrame({
    'customer_id': [1,2,3,4,5],
    'name' : ['Geeta','Ram','Hari','Shyam','Sita']
})
customer_data

   customer_id   name
0            1  Geeta
1            2    Ram
2            3   Hari
3            4  Shyam
4            5   Sita

- How   : inner:column,
- Left  : all left table and common from right
- Right :all right table and common from left

In [ ]:
tips.merge(customer_data, on = 'customer_id',how='right')

   total_bill   tip     sex smoker  day    time  size  customer_id   name
0       16.99  1.01  Female     No  Sun  Dinner     2            1  Geeta
1       10.34  1.66    Male     No  Sun  Dinner     3            2    Ram
2       21.01  3.50    Male     No  Sun  Dinner     3            3   Hari
3       23.68  3.31    Male     No  Sun  Dinner     2            4  Shyam
4       24.59  3.61  Female     No  Sun  Dinner     4            5   Sita

In [13]:
customer_data_conflict = pd.DataFrame({
    'customer_id' : [1,2,3,4,5],
    'name': ['Geeeta','Ram','Hari','Shyam','Sita'],
    'size': ['Small', 'Medium', 'Large', 'Small','Medium']
})
customer_data_conflict

   customer_id    name    size
0            1  Geeeta   Small
1            2     Ram  Medium
2            3    Hari   Large
3            4   Shyam   Small
4            5    Sita  Medium

In [14]:
tips.merge(customer_data_conflict,on = 'customer_id',suffixes=['_tips','_customer'])

,total_bill,tip,sex,smoker,day,time,size_tips,customer_id,name,size_customer
0,16.99,1.01,Female,No,Sun,Dinner,2,1,Geeeta,Small
1,10.34,1.66,Male,No,Sun,Dinner,3,2,Ram,Medium
2,21.01,3.50,Male,No,Sun,Dinner,3,3,Hari,Large
3,23.68,3.31,Male,No,Sun,Dinner,2,4,Shyam,Small
4,24.59,3.61,Female,No,Sun,Dinner,4,5,Sita,Medium

## From multiple columns

In [15]:
shift_data = pd.DataFrame({
    'day' : ['Sun','Mon','Fri', 'Sat'],
    'time' : ['Dinner','Lunch','Dinner','Lunch'],
    'shift_manager': ['Geeta','Swaraj','Alex','Bipasha']
})
shift_data

   day    time shift_manager
0  Sun  Dinner         Geeta
1  Mon   Lunch        Swaraj
2  Fri  Dinner          Alex
3  Sat   Lunch       Bipasha

In [19]:
tips.merge(shift_data, on=['day','time'],how='right')

,total_bill,tip,sex,smoker,day,time,size,customer_id,shift_manager
0,16.99,1.01,Female,No,Sun,Dinner,2.0,1.0,Geeta
1,10.34,1.66,Male,No,Sun,Dinner,3.0,2.0,Geeta
2,21.01,3.50,Male,No,Sun,Dinner,3.0,3.0,Geeta
3,23.68,3.31,Male,No,Sun,Dinner,2.0,4.0,Geeta
4,24.59,3.61,Female,No,Sun,Dinner,4.0,5.0,Geeta
...,...,...,...,...,...,...,...,...,...
85,21.01,3.00,Male,Yes,Fri,Dinner,2.0,99.0,Alex
86,12.46,1.50,Male,No,Fri,Dinner,2.0,100.0,Alex
87,11.35,2.50,Female,Yes,Fri,Dinner,2.0,101.0,Alex
88,15.38,3.00,Female,Yes,Fri,Dinner,2.0,102.0,Alex
89,NaN,NaN,NaN,NaN,Sat,Lunch,NaN,NaN,Bipasha

## Join

In [22]:
tips_subset = tips.set_index('customer_id')
customer_data_subset = customer_data.set_index('customer_id')

In [24]:
tips_subset.join(customer_data_subset, on= 'customer_id', how='right')

             total_bill   tip     sex smoker  day    time  size   name
customer_id
1                 16.99  1.01  Female     No  Sun  Dinner     2  Geeta
2                 10.34  1.66    Male     No  Sun  Dinner     3    Ram
3                 21.01  3.50    Male     No  Sun  Dinner     3   Hari
4                 23.68  3.31    Male     No  Sun  Dinner     2  Shyam
5                 24.59  3.61  Female     No  Sun  Dinner     4   Sita

In [25]:
tips.join(customer_data, lsuffix='_tips',rsuffix='_customer')

,total_bill,tip,sex,smoker,day,time,size,customer_id_tips,customer_id_customer,name
0,16.99,1.01,Female,No,Sun,Dinner,2,1,1.0,Geeta
1,10.34,1.66,Male,No,Sun,Dinner,3,2,2.0,Ram
2,21.01,3.50,Male,No,Sun,Dinner,3,3,3.0,Hari
3,23.68,3.31,Male,No,Sun,Dinner,2,4,4.0,Shyam
4,24.59,3.61,Female,No,Sun,Dinner,4,5,5.0,Sita
...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,240,NaN,NaN
240,27.18,2.00,Female,Yes,Sat,Dinner,2,241,NaN,NaN
241,22.67,2.00,Male,Yes,Sat,Dinner,2,242,NaN,NaN
242,17.82,1.75,Male,No,Sat,Dinner,2,243,NaN,NaN
243,18.78,3.00,Female,No,Thur,Dinner,2,244,NaN,NaN

In [27]:
tips_subset.loc[[1,2,3,4,5,6,7]].join(customer_data_subset,how='outer')

             total_bill   tip     sex smoker  day    time  size   name
customer_id
1                 16.99  1.01  Female     No  Sun  Dinner     2  Geeta
2                 10.34  1.66    Male     No  Sun  Dinner     3    Ram
3                 21.01  3.50    Male     No  Sun  Dinner     3   Hari
4                 23.68  3.31    Male     No  Sun  Dinner     2  Shyam
5                 24.59  3.61  Female     No  Sun  Dinner     4   Sita
6                 25.29  4.71    Male     No  Sun  Dinner     4    NaN
7                  8.77  2.00    Male     No  Sun  Dinner     2    NaN

In [29]:
# Index and column
tips_subset.merge(customer_data_conflict, right_on='customer_id',left_index=True,suffixes=['_tips','_customer'])

,total_bill,tip,sex,smoker,day,time,size_tips,customer_id,name,size_customer
0,16.99,1.01,Female,No,Sun,Dinner,2,1,Geeeta,Small
1,10.34,1.66,Male,No,Sun,Dinner,3,2,Ram,Medium
2,21.01,3.50,Male,No,Sun,Dinner,3,3,Hari,Large
3,23.68,3.31,Male,No,Sun,Dinner,2,4,Shyam,Small
4,24.59,3.61,Female,No,Sun,Dinner,4,5,Sita,Medium

### Concatenation

In [31]:
tips.head()

   total_bill   tip     sex smoker  day    time  size  customer_id
0       16.99  1.01  Female     No  Sun  Dinner     2            1
1       10.34  1.66    Male     No  Sun  Dinner     3            2
2       21.01  3.50    Male     No  Sun  Dinner     3            3
3       23.68  3.31    Male     No  Sun  Dinner     2            4
4       24.59  3.61  Female     No  Sun  Dinner     4            5

## Split tips into three parts

In [32]:
tips_1 = tips.iloc[:10]
tips_2 = tips.iloc[10:20]
tips_3 = tips.iloc[20:30]

## Concatenate vertically with keys

In [34]:
pd.concat([tips_1,tips_2,tips_3],axis=0, keys=['part1','part2','part3'])

          total_bill   tip     sex smoker  day    time  size  customer_id
part1 0        16.99  1.01  Female     No  Sun  Dinner     2            1
      1        10.34  1.66    Male     No  Sun  Dinner     3            2
      2        21.01  3.50    Male     No  Sun  Dinner     3            3
      3        23.68  3.31    Male     No  Sun  Dinner     2            4
      4        24.59  3.61  Female     No  Sun  Dinner     4            5
      5        25.29  4.71    Male     No  Sun  Dinner     4            6
      6         8.77  2.00    Male     No  Sun  Dinner     2            7
      7        26.88  3.12    Male     No  Sun  Dinner     4            8
      8        15.04  1.96    Male     No  Sun  Dinner     2            9
      9        14.78  3.23    Male     No  Sun  Dinner     2           10
part2 10       10.27  1.71    Male     No  Sun  Dinner     2           11
      11       35.26  5.00  Female     No  Sun  Dinner     4           12
      12       15.42  1.57    Male     No  Sun  Dinner     2           13
      13       18.43  3.00    Male     No  Sun  Dinner     4           14
      14       14.83  3.02  Female     No  Sun  Dinner     2           15
      15       21.58  3.92    Male     No  Sun  Dinner     2           16
      16       10.33  1.67  Female     No  Sun  Dinner     3           17
      17       16.29  3.71    Male     No  Sun  Dinner     3           18
      18       16.97  3.50  Female     No  Sun  Dinner     3           19
      19       20.65  3.35    Male     No  Sat  Dinner     3           20
part3 20       17.92  4.08    Male     No  Sat  Dinner     2           21
      21       20.29  2.75  Female     No  Sat  Dinner     2           22
      22       15.77  2.23  Female     No  Sat  Dinner     2           23
      23       39.42  7.58    Male     No  Sat  Dinner     4           24
      24       19.82  3.18    Male     No  Sat  Dinner     2           25
      25       17.81  2.34    Male     No  Sat  Dinner     4           26
      26       13.37  2.00    Male     No  Sat  Dinner     2           27
      27       12.69  2.00    Male     No  Sat  Dinner     2           28
      28       21.70  4.30    Male     No  Sat  Dinner     2           29
      29       19.65  3.00  Female     No  Sat  Dinner     2           30

In [ ]:
vertical.concat.index

In [ ]:
vertical_concat.loc[('part1',0)]

## Horizontal Concatenate

In [35]:
extra_data = pd.DataFrame({
    'customer_id' : [1,2,3,4,5],
    'rating' : [4,5,3,2,5]
},index= tips.head().index)
extra_data

   customer_id  rating
0            1       4
1            2       5
2            3       3
3            4       2
4            5       5

In [36]:
pd.concat([tips.head(),extra_data],axis=1, join = 'inner')

,total_bill,tip,sex,smoker,day,time,size,customer_id,customer_id,rating
0,16.99,1.01,Female,No,Sun,Dinner,2,1,1,4
1,10.34,1.66,Male,No,Sun,Dinner,3,2,2,5
2,21.01,3.50,Male,No,Sun,Dinner,3,3,3,3
3,23.68,3.31,Male,No,Sun,Dinner,2,4,4,2
4,24.59,3.61,Female,No,Sun,Dinner,4,5,5,5